tutorials/alphaParameterstudy_interpolatedPhi/alpha0/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    alpha.ibm
    {
        nAlphaCorr      1;
        nAlphaSubCycles 1;
        cAlpha          2; //compression coefficient

        advectionScheme isoAdvection;
        reconstructionScheme plicRDF;
    }

    p
    {
        solver          GAMG;
        tolerance       1e-10;
        relTol          0;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        smoother        DICGaussSeidel;
        tolerance       1e-13;//1e-8
        relTol          0;
    }

    "pcorr.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-12;
        relTol          0;
    }

    "(U)"
    {
        solver          smoothSolverIBM;
        geometry        naca0006;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    "(U)Final"
    {
        solver          smoothSolverIBM;
        geometry        naca0006;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
        minIter         1;
    }

    "alpha.naca0006.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 1;
        cAlpha          3;

        advectionScheme         isoAdvection;
        reconstructionScheme    plicRDF;

        MULESCorr       yes;
        nLimiterIter    3;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
        minIter         3;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors    0;
    nCorrectors			3;
    consistent			yes;		//SIMPLEC-Algorithmus insbesondere im stat. sonst divergent

    residualControl
        {
            U   1e-07;
            p   1e-07;
        }   
}

relaxationFactors
{
    fields
    {
        p               0.5;
    }
    equations
    {
        "(U)"           0.7;  //1
        "(U)Final"      0.7;  //1
    }
}

PIMPLE
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;

    //pRefPoint               (-9 0 0);
    //pRefValue               0;

    residualControl
    {
        U
        {
            tolerance       1e-5;
            relTol          0;
        }
        p
        {
            tolerance       1e-08;
            relTol          0;
        }
    }
}


// ************************************************************************* //
